In [3]:
import pandas as pd

In [4]:
data = pd.read_csv("Chicago_city.csv")
data.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

Manipulating a column data using inbuilt String fn's
---------

In [5]:
data['Department'].str.lower()

0             water mgmnt
1                  police
2                  police
3        general services
4             water mgmnt
               ...
32058              police
32059              police
32060              police
32061                doit
32062                 NaN
Name: Department, Length: 32063, dtype: object

In [6]:
data['Employee Annual Salary'].str.replace('$',' ').astype('float')

C:\Users\miles\AppData\Local\Temp\ipykernel_33620\2951150230.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  data['Employee Annual Salary'].str.replace('$',' ').astype('float')

0         90744.0
1         84450.0
2         84450.0
3         89880.0
4        106836.0
           ...
32058     87384.0
32059     84450.0
32060     87384.0
32061    113664.0
32062         NaN
Name: Employee Annual Salary, Length: 32063, dtype: float64

In [7]:
data.set_index((data['Position Title'].str.replace('-',' ')).str.lower())

,Name,Position Title,Department,Employee Annual Salary
Position Title,,,,
water rate taker,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
police officer,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
police officer,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
chief contract expediter,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
civil engineer iv,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00
...,...,...,...,...
police officer,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
police officer,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
police officer,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
chief data base analyst,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
NaN,NaN,NaN,NaN,NaN

In [22]:
data['Position Title'].apply(lambda x : str(x).split(' ') if x == "POLICE OFFICER" else x).str.get(0)

0             W
1        POLICE
2        POLICE
3             C
4             C
          ...
32058    POLICE
32059    POLICE
32060    POLICE
32061         C
32062       NaN
Name: Position Title, Length: 32063, dtype: object

In [41]:
import pandas as pd

# Create a dataframe
df = pd.DataFrame({'col1': [1, 2, 3, 4], 'col2': ['A', 'B', 'C', 'D']})

# Use a lambda function to apply to each element of col1
data = list(map(lambda x: x + 10,[1,2,3,4,5]))

# The dataframe now has col1 with elements [11, 12, 13, 14]
print(data)

[11, 12, 13, 14, 15]

take dept col, repalce all word as mgmnt with management also find out those word which is ending with keyword ment and count occurance.

In [35]:
data['Department'].str.replace('MGMNT','Management').str.upper().str.endswith('MENT').value_counts()

False    29931
True      2131
Name: Department, dtype: int64